{
    "address": {
        "street_address": "400 Fifth Avenue",
        "locality": "New York City, NY 10018-2753",
        "zipcode": "10018-2753",
        "country": "United States"
    },
    "ratings": {
        "Excellent": 1767,
        "Very good": 254,
        "Average": 86,
        "Poor": 38,
        "Terrible": 24
    },
    "amenities": {},
    "official_description": "Gracefully complementing Manhattan's luxurious Fifth Avenue and boldly accenting New York City's famous skyline, The Langham, New York, Fifth Avenue is a renewed celebration of sophistication and style. Soaring more than sixty stories above the city, The Langham, Fifth Avenue represents the new heart of the world's most inspired metropolis. Accommodations exude the very essence of luxury and elegance. Duxiana beds, Pratesi linens, and floor-to-ceiling rain showers leave guests breathing easy, if not breathless.Price range$538 - $1,353 (Based on Average Rates for a Standard Room) Hotel classStar rating provided by Expedia.Hotel Style#3 Spa Hotel in New York City#5 Family Hotel in New York City#9 Business Hotel in New York City#14 Romantic Hotel in New York City#21 Luxury Hotel in New York CityRoom typesSuites, Non-Smoking RoomsNumber of rooms234Reservation OptionsTripAdvisor is proud to partner with Booking.com, Expedia, Travelocity, Orbitz, DerbySoft Ltd Shanghai HQ Supplier Direct, Otel, Priceline, Hotels.com, Hotwire, Cancelon, TripOnline SA, HotelsClick, HotelQuickly, getaroom.com and GalaHotels so you can book your The Langham New York Fifth Avenue reservations with confidence. We help millions of travelers each month to find the perfect hotel for both vacation and business trips, always with the best discounts and special offers.LocationUnited States > New York > New York City > Midtown / Garment District / ManhattanFormerly known asThe Setai Fifth Avenue",
    "additional_info": {},
    "rating": 0.0,
    "review_count": 80,
    "name": "The Langham New York Fifth Avenue",
    "rank": "#22 of 482 Hotels in New York City",
    "highlights": "",
    "hotel_url": "https://www.tripadvisor.com/Hotel_Review-g60763-d1776857-Reviews-The_Langham_New_York_Fifth_Avenue-New_York_City_New_York.html"
}